// арифметические выражения преобразуются к числу
1 / 2
i++
i -= 2
i * 2

// строковые - к строке
"привет, " + "мир"
'hello, ' += 'world'

// логические - к булеву значению
a && b
a || b
!a

// литералы, переменные, константы - это тоже выражения
2
0.02
'something'
true
false
this 
undefened
i

// как и некоторые ключевые слова
function
class
function* 
yield 
/pattern/i
() // группирующие скобки

// выражения создания и инициализации
[]
{a: 1, b: 2}
new Person()
functions() {}
a => a

// выражения вызова функций и методов
Math.paw(2, 3)
window.resize()